src/cf/Enums/уатПредметыДоговоровКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>уатПредметыДоговоровКонтрагентов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Перевозка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Такси</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Аренда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеУслуги</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/уатПредметыДоговоровКонтрагентов/Ext/ManagerModule.bsl
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = Новый СписокЗначений();
	ДанныеВыбора.Добавить(Перечисления.уатПредметыДоговоровКонтрагентов.Перевозка);
	Если уатОбщегоНазначенияПовтИсп.ВариантПоставкиТакси() Тогда
		Если ПолучитьФункциональнуюОпцию("такИспользоватьЗаказыТакси") Тогда
			ДанныеВыбора.Добавить(Перечисления.уатПредметыДоговоровКонтрагентов.Такси);
		КонецЕсли;
		Если ПолучитьФункциональнуюОпцию("такИспользоватьАрендуТС") Тогда
			ДанныеВыбора.Добавить(Перечисления.уатПредметыДоговоровКонтрагентов.Аренда);
		КонецЕсли; 
	КонецЕсли; 
	ДанныеВыбора.Добавить(Перечисления.уатПредметыДоговоровКонтрагентов.ПрочиеУслуги);
	
КонецПроцедуры
